scaffold_sim/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    defaultFaces
    {
    	type		noSlip;
    }
    
    "(walls|mesh_geometry)"
    {
    	type		noSlip;
    }
    
    inlet
    {
        type         		   fixedValue;
        volumetricFlowRate	   0.124; //15 mL/min
    }
        
    /*
    inlet
    {
        type            uniformFixedValue;
        uniformValue    
        {
            type            sine;
            amplitude       
            {
                type            constant;
                value           (0 0 100e-6);
            }
            frequency       1;
            start           0;
            level           
            {
                type            constant;
                value           (0 0 0);
            }
        }
        value           uniform (0 0 0);
    }
    */
    
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    

/*
    from-solid-to-fluid-wall
    {
        type            noSlip;
    }
    from-solid-to-zmin-wall
    {
        type            uniformFixedValue;
        uniformValue    
        {
            type            sine;
            amplitude       
            {
                type            constant;
                value           (0 0 1);
            }
            frequency       1;
            start           0;
            level           
            {
                type            constant;
                value           (0 0 0);
            }
        }
        value           uniform (0 0 0);
    }
    from-solid-to-zmax-wall
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    from-solid-to-background-wall
    {
        type            noSlip;
    }
*/    
    
    
}


// ************************************************************************* //
