scaffold_sim/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    defaultFaces
    {
    	type		zeroGradient;
    }
    
    "(walls|mesh_geometry)"
    {
    	type		zeroGradient;
    }
    
    inlet
    {
        type           zeroGradient;
    }
    
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

/*
    from-solid-to-fluid-wall
    {
        type            zeroGradient;
    }
    from-solid-to-zmin-wall
    {
        type            zeroGradient;
    }
    from-solid-to-zmax-wall
    {
        type            fixedValue;
        value           uniform 0;
    }
    from-solid-to-background-wall
    {
        type            zeroGradient;
    }
*/    
    
    
    
}


// ************************************************************************* //
